localization/subscribe.xml

<s:Envelope xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:e="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">
    <s:Header>
        <a:To>http://gilroy:5985/wsman</a:To>
        <w:ResourceURI s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/EventLog</w:ResourceURI>
        <a:ReplyTo>
            <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
        </a:ReplyTo>
        <a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/eventing/Subscribe</a:Action>
        <w:MaxEnvelopeSize s:mustUnderstand="true">153600</w:MaxEnvelopeSize>
        <a:MessageID>uuid:40E5E215-9AE6-4BB2-BF59-5BE542B6E67B</a:MessageID>
        <w:Locale s:mustUnderstand="false" xml:lang="en-US"/>
        <p:DataLocale s:mustUnderstand="false" xml:lang="en-US"/>
        <w:OptionSet xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <w:Option Name="SubscriptionName">ZenossSubscription</w:Option>
            <w:Option Name="ContentFormat">RenderedText</w:Option>
            <w:Option Name="IgnoreChannelError" xsi:nil="true"/>
        </w:OptionSet>
        <w:OperationTimeout>PT60.000S</w:OperationTimeout>
    </s:Header>
    <s:Body>
        <e:Subscribe>
            <e:Delivery Mode="http://schemas.dmtf.org/wbem/wsman/1/wsman/Pull">
                <w:Heartbeats>PT5.000S</w:Heartbeats>
                <w:Locale s:mustUnderstand="false" xml:lang="en-US"/>
                <p:DataLocale s:mustUnderstand="false" xml:lang="en-US"/>
                <w:ContentEncoding>UTF-8</w:ContentEncoding>
            </e:Delivery>
            <e:Expires>PT3759670629.777S</e:Expires>
            <w:Filter Dialect="http://schemas.microsoft.com/win/2004/08/events/eventquery">{event_query}</w:Filter>
            <w:SendBookmarks/>
        </e:Subscribe>
    </s:Body>
</s:Envelope>
